Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_sqs_queue.dead_letter_queue will be created
+ resource "aws_sqs_queue" "dead_letter_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "atlantis-example-queue-dlq"
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags                              = {
          + "everquote:aws:account" = "distribution-platform"
          + "everquote:category"    = "terraform"
          + "everquote:env"         = "staging"
          + "everquote:heritage"    = "terraform"
          + "everquote:owner"       = "distribution-platform-engineering"
          + "everquote:service"     = "example-queue"
        }
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.default will be created
+ resource "aws_sqs_queue" "default" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "atlantis-example-queue"
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_policy                    = (known after apply)
      + tags                              = {
          + "everquote:aws:account" = "distribution-platform"
          + "everquote:category"    = "terraform"
          + "everquote:env"         = "staging"
          + "everquote:heritage"    = "terraform"
          + "everquote:owner"       = "distribution-platform-engineering"
          + "everquote:service"     = "example-queue"
        }
      + visibility_timeout_seconds        = 30
    }

  # null_resource.example will be created
+ resource "null_resource" "example" {
      + id = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://2ee6482ed96e.ngrok.io/lock?id=nitzan86%252Fatlantis-example%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
